fix course
